# Дан список чисел. Определите,
# сколько в нем встречается различных чисел.

list_nums = [1, 1, 4, 6, 7, 0, 6, 7]
print(len(set(list_nums)))